# Apply

This instance happens when you want to perform more complex calculations on your data rather than addind or substracting two columns.

Things of such kind might prevent you from wrting a for loop to iterate over a whole column for instance

In [1]:
import pandas as pd

In [2]:
def my_function():
    # indent 4 spaces
    # function code
    pass

In [4]:
def my_sq(x):
    """squares a given value
    """
    return x ** 2

In [5]:
my_sq(2)

4

In [6]:
my_sq(4)

16

In [7]:
def avg_2(x, y):
    """calculates average between 2 numbers
    """
    return (x + y) / 2.0

In [9]:
avg_2(10, 20)

15.0

In [2]:
df1 = pd.DataFrame({
        "A": [5,10,15],
        "B": [3,6,9]
    })

In [3]:
df1

    A  B
0   5  3
1  10  6
2  15  9

In [9]:
df1['A'].apply(my_sq)

0     25
1    100
2    225
Name: A, dtype: int64

In [10]:
df1['A'] ** 2

0     25
1    100
2    225
Name: A, dtype: int64

Now we want to understand how an **apply function** works on a dataframe

In [14]:
def print_me(x):
    print(x)
df1

    A  B
0   5  3
1  10  6
2  15  9

In [15]:
df1.apply(print_me)

0     5
1    10
2    15
Name: A, dtype: int64
0    3
1    6
2    9
Name: B, dtype: int64

A    None
B    None
dtype: object

In [11]:
def avg_3(x, y, z):
    """avg of 3 numbers
    """
    return (x + y + z) / 3

In [13]:
df1.apply(avg_3)

TypeError: ("avg_3() missing 2 required positional arguments: 'y' and 'z'", 'occurred at index A')

In [16]:
def Avg_3(col):
    """perform the average over a dataframe"""
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

In [18]:
df1.apply(Avg_3)

A    10.0
B     6.0
dtype: float64

In [19]:
df1

    A  B
0   5  3
1  10  6
2  15  9

In [23]:
df1.apply(Avg_3, axis=0)

A    10.0
B     6.0
dtype: float64

In [24]:
def avg_2(row):
    """avg of 2 numbers
    """
    x = row[0]
    y = row[1]
    return (x + y) / 2
df1.apply(avg_2, axis=1)

0     4.0
1     8.0
2    12.0
dtype: float64

In [25]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

In [26]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [27]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [30]:
import numpy as np

1. Write a function which is going to return a count of missing values column-wise

In [29]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [31]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [42]:
titanic.apply(count_missing, axis=1).value_counts() #549 rows have 1 missing values 182 have 0 missing value

1    549
0    182
2    160
dtype: int64

    2. Write a function which is going to return a proportion of the missing values

In [ ]:
#A proportion is just what I took over the size of the whole thing

In [32]:
def prop_missing(vec):
    num = count_missing(vec)
    den = vec.size
    return num / den

In [33]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

     3.  Write a function which  computes the remaining proportion

In [34]:
def prop_complete(vec):
    return 1 - prop_missing(vec)

In [35]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [43]:
#titanic.loc[pd.isnull(titanic['embark_town']), :]